// Smile.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>

constexpr int sizeX = 20;
constexpr int sizeY = 20;
const char pixels[5]{ 32, 176, 177, 178, 219 };

int (*Gray2Bin(int (*a)[sizeX], int rows, int threshold, int value))[sizeX]
{
    int (*bin)[sizeX] = new int[rows][sizeX];
    for (int i = 0; i < rows; i++)
        for (int j = 0; j < sizeX; j++)
            bin[i][j] = a[i][j] >= threshold ? value : 0;
    return bin;
}

int main()
{
    int (*smile)[sizeX] = new int[sizeY][sizeY]{
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,4,3,4,3,4,3,4,3,4,3,4,3,4,3,4,3,4,3,0},
        {0,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0},
        {0,4,4,2,0,4,4,4,4,4,4,4,4,4,4,0,2,4,4,0},
        {0,4,4,0,0,4,4,4,4,4,4,4,4,4,4,0,0,4,4,0},
        {0,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0},
        {0,4,4,4,4,1,1,1,4,4,4,4,1,1,1,4,4,4,4,0},
        {0,4,4,4,4,0,3,0,4,4,4,4,0,3,0,4,4,4,4,0},
        {0,4,4,4,4,1,1,1,4,4,4,4,1,1,1,4,4,4,4,0},
        {0,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0},
        {0,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0},
        {0,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,4,4,0},
        {0,4,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,3,4,0},
        {0,4,3,2,1,1,1,1,1,1,1,1,1,1,1,1,2,3,4,0},
        {0,4,3,2,1,1,1,1,1,1,1,1,1,1,1,1,2,3,4,0},
        {0,4,3,2,1,1,1,1,1,1,1,1,1,1,1,1,2,3,4,0},
        {0,4,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,3,4,0},
        {0,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,4,4,0},
        {0,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    };

    for (int i = 0; i < sizeY; i++)
    {
        for (int j = 0; j < sizeX; j++)
        {
            std::cout << pixels[smile[i][j]];
        }
        std::cout << std::endl;
    }

    auto bin = Gray2Bin(smile, sizeY, 4, 4);
    for (int i = 0; i < sizeY; i++)
    {
        for (int j = 0; j < sizeX; j++)
        {
            std::cout << pixels[bin[i][j]];
        }
        std::cout << std::endl;
    }

    delete[] smile;
    delete[] bin;
}

